OpenFOAM/installationsWithAdditionalTools/openfoam-org/5.x_CFDEM/testCases/enzu_test/CFD.base/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     cfdemSolverPiso;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.01;

deltaT          3e-4;

//writeControl    adjustableRunTime;
writeControl    timeStep;

//writeInterval   100;
writeInterval   10;

//purgeWrite      0;
//Pawsey Best Practice (if possible):
purgeWrite      10;

//writeFormat     ascii;
//Pawsey Best Practice:
writeFormat     binary;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   8;

//runTimeModifiable yes;
//Pawsey Best Practice:
runTimeModifiable no;

libs ( "libfvOptionsCFDEM.so" );

// ************************************************************************* //


