OpenFOAM/installationsWithAdditionalTools/openfoam-org/5.x_CFDEM/testCases/enzu_test/CFD.base/0/nu
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nu;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
87615
(
2.1324821e-05
2.6275843e-05
3.1208398e-05
2.842201e-05
2.4898314e-05
2.3962393e-05
2.6181028e-05
3.1538832e-05
...
)
;

boundaryField
{
    WALL
    {
        type            calculated;
        value           nonuniform List<scalar> 
5940
(
1.9311231e-05
1.974568e-05
2.0028287e-05
2.0310791e-05
2.0243373e-05
1.9464006e-05
1.8495375e-05
1.7875018e-05
...
)
;
    }
    cyclic_in
    {
        type            cyclic;
    }
    cyclic_out
    {
        type            cyclic;
    }
}


// ************************************************************************* //
